app/Controllers/Auth.php

    public function index()
    {
        $usermodel = new UserModel();
        $data['users'] =  $usermodel->findAll();
---
SELECT *
FROM `users`

    public function processLogin()
    {
        $loginInput = $this->request->getPost('username'); // assuming it can be either email or username
        $password = $this->request->getPost('password');

        $userModel = new UserModel();

        // Check if the input is a valid email
        if (filter_var($loginInput, FILTER_VALIDATE_EMAIL)) {
            $user = $userModel->where('email', $loginInput)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'adm1@gmail.com'
 LIMIT 1

            'role' => $this->request->getPost('role'),
        ];

        $userModel->insert($data);
---
INSERT INTO `users` (`username`, `email`, `nama`, `telp`, `password`, `role`) VALUES ('acaasas', 'acasini@gmail.com', 'asasa', '12341', '$2y$10$M9DZBVvnyBQHpZGkQN44BO8HPs4ER3bp0cVwwWnQzP0QerISDGU0W', 'admin')

    public function updateusers($usersId)
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'username' => 'required|is_unique[users.username,username,' . $usersId . ']',
            'email' => 'required|valid_email|is_unique[users.email,username,' . $usersId . ']',
            'nama' => 'required',
            'telp' => 'required',
            'password' => 'min_length[6]',
            'role' => 'required',
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->to("admin/edit_user/$usersId")->withInput()->with('errors', $validation->getErrors());
---
SELECT *
FROM `users`
WHERE `users`.`username` = 'User'