app/Controllers/BokDriver.php

    public function detail_booking_driver($bookingId)
    {
        $usersModel = new UserModel();
        $driverModel = new DriverModel();
        $bookingDriverModel = new bokdriverModel();

        $bookingDriver = $bookingDriverModel->find($bookingId);
        $picUser = $usersModel->getUserByName($bookingDriver['username']);

        $data['bookingDrivers'] = $bookingDriver;
        $data['drivers'] = $driverModel->findAll();
---
SELECT *
FROM `driver`