app/Controllers/BokRoomController.php

    public function request_detail($id)
    {
        $usersModel = new UserModel();
        $bookingRuanganModel = new bokruanganModel();
        $room = $this->ruanganModel->findAll();
---
SELECT *
FROM `ruangan`