app/Controllers/Driver.php

    public function index()
    {
        $drivermodel = new DriverModel();
        $keyword = $this->request->getVar('keyword');

        if ($keyword) {
            $data['driver'] = $drivermodel->search($keyword);
        } else {
            $data['driver'] = $drivermodel->findAll();
---
SELECT *
FROM `driver`