app/Controllers/RuanganControllers.php

    public function index()
    {
        $ruanganmodel = new RuanganModel();
        $keyword = $this->request->getVar('keyword');

        if ($keyword) {
            $data['room'] = $ruanganmodel->search($keyword);
        } else {
            $data['room'] = $ruanganmodel->findAll();
---
SELECT *
FROM `ruangan`