app/Models/bokdriverModel.php

    public function getPendingBookings()
    {
        return $this->select('booking_driver.*, users.nama')
            ->join('users', 'users.username = booking_driver.username')
            ->where('booking_driver.status', 'pending')
            ->findAll();
---
SELECT `booking_driver`.*, `users`.`nama`
FROM `booking_driver`
JOIN `users` ON `users`.`username` = `booking_driver`.`username`
WHERE `booking_driver`.`status` = 'pending'

    public function getBookingsForToday($date, $status)
    {
        return $this->select('booking_driver.*, users.nama as pic')
            ->join('users', 'users.username = booking_driver.username', 'left')
            ->where('booking_driver.status', $status)
            ->findAll();
---
SELECT `booking_driver`.*, `users`.`nama` as `pic`
FROM `booking_driver`
LEFT JOIN `users` ON `users`.`username` = `booking_driver`.`username`
WHERE `booking_driver`.`status` = 'pending'