app/Models/bokruanganModel.php

    public function getPendingBookings()
    {
        return $this->select('booking_ruangan.*, users.nama')
            ->join('users', 'users.username = booking_ruangan.username')
            ->where('booking_ruangan.status', 'pending')
            ->findAll();
---
SELECT `booking_ruangan`.*, `users`.`nama`
FROM `booking_ruangan`
JOIN `users` ON `users`.`username` = `booking_ruangan`.`username`
WHERE `booking_ruangan`.`status` = 'pending'

    public function getBookingsForToday($date, $status)
    {
        return $this->select('booking_ruangan.*, users.nama as pic')
            ->join('users', 'users.username = booking_ruangan.username', 'left')
            ->where('booking_ruangan.status', $status)
            ->findAll();
---
SELECT `booking_ruangan`.*, `users`.`nama` as `pic`
FROM `booking_ruangan`
LEFT JOIN `users` ON `users`.`username` = `booking_ruangan`.`username`
WHERE `booking_ruangan`.`status` = 'pending'