app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = '2111523021'
 LIMIT 1
---
    public function getUserByName($username)
    {
        return $this->where('username', $username)->first();